Repository: Leonti/etmmanager
Catalog: share/locale/*/LC_MESSAGES/etmmanager.po
Languages: es, pl, pt, ru

source: ETM manager about
es: Sobre ETM Manager
pl: O programie ETM Manager
pt: Sobre o ETM MANAGER
ru: О ETM manager

source: Created and programmed by:
es: Ha sido creado y programado por:
pl: Program stworzono przez:
pt: Feito e programado por:
ru: Програму написал:

source: Using:
es: Usando:
pl: Używając:
pt: Licença
ru: Используя:

source: GNU GPL v2 license
es: GNU GPL v2 licencia
pl: GNU GPL v2 licencja
pt: Licença GNU GPL V.2
ru: Лицензия GNU GPL v2

source: Close
es: Cerrar
pl: Zamknij
pt: Fechar
ru: Закрыть

source: Please edit this setting before connecting to the database.
es: Por favor, revise estos parámetros antes de conectar a la base de datos.
pl: Proszę edytować te preference przed połączeniem się z bazą danych.
pt: Por favor preencha todos os campos antes de se conectar á BD
ru: Необходимо отредактировать эти установки перед подключением к базе данных.

source: Host
es: Servidor
pt: Servidor
ru: Хост

source: User
es: Usuario
pl: Użytkownik
pt: Utilizador
ru: Пользователь

source: Password
es: Contraseña
pl: Hasło
ru: Пароль

source: Database name
es: Nombre de la base de datos
pl: Nazwa bazy danych
pt: Base de dados
ru: Имя базы данных

source: Create database
es: Crear base de datos
pl: Stwórz bazę danych
pt: Criar base de dados...
ru: Создать базу данных

source: Show this dialog on next startup
es: Mostrar este diálogo en próximo inicio
pl: Pokaż to okienko następnym razem
pt: Aparecer da próxima vez que iniciar o programa.
ru: Показать это окно при следующем запуске

source: Database was created, but the structure was not restored.
es: La base de datos ha sido creada pero estructura no esta importada.
pl: Baza danych została stworzona, jednak jej struktura nie została zimportowana.
pt: A base de dados foi criada, mas a estrutura não foi restaurada.
ru: База данных была создана, но её структура не была заимпортирована.

source: Edit time entries
es: Revisar los puntos del tiempo
pl: Edytuj zapisy czasu
pt: Editar entradas...
ru: Изменить записи

source: Add
es: Añadir
pl: Dodaj
pt: Adicionar
ru: Добавить

source: Delete
es: Suprimir
pl: Kasuj
pt: Apagar
ru: Удалить

source: Save
es: Guardar
pl: Zachowaj
pt: Guardar
ru: Сохранить

source: Cancel
es: Cancelar
pl: Zrezygnuj
pt: Cancelar
ru: Отмена

source: Time
es: Tiempo
pl: Czas
pt: Tempo
ru: Время

source: Job
es: Puesto
pl: Stanowisko
pt: Cargo
ru: Позиция

source: OFF
es: LIBRE
pt: Terminar
ru: ОТДЫХ

source: Beginning date
es: Tiempo del inicio
pl: Czas rozpoczęcia
pt: Data de inicio
ru: Начало периода

source: Ending date
es: Tiempo del fin
pl: Czas zakończenia
pt: Data final
ru: Конец периода

source: Get info
es: Mostrar info
pl: Pokaż info
pt: Reunir informação.
ru: Показать

source: Get time and job information for selected employee in a selected period of time
es: Mostrar información sobre el seleccionado empleador en seleccionado período del tiempo
pl: Pokaż informacje dla wybranego pracownika w wybranym okresie czasu
pt: Obter informação de horas e cargo de um colaborador num determinado periodo de tempo.
ru: Показать инфорацию для выбранного работника и для выбранного периода

source: Select an employee
es: Seleccione el empleador
pl: Wybierz pracownika
pt: Escolha um trabalhador
ru: Выбрать работника

source: Name:
es: Nombre:
pl: Imię:
pt: Nome
ru: Имя

source: Code:
es: Código:
pl: Kod:
pt: Código
ru: Код

source: Comment:
es: Comentario:
pl: Uwagi:
pt: Comentários
ru: Комментарий

source: Jobs:
es: Puestos:
pl: Stanowiska:
pt: Cargo
ru: Позиции:

source: Totals for hours and payment
es: Totales para el tiempo y el pago
pl: Podsumowanie dla czasu i zapłaty
pt: Total de horas e remuneração
ru: Сумма времени и выплат

source: Double click on a date to change hours
es: Doble clic sobre la fecha para cambiar las horas
pl: Podwójny klik na dacie dla zmiany zapisów czasu
pt: Duplo click na data para mudar horas.
ru: Двойной щелчок на дате для изменения часовых записей

source: Make backup
es: Hacer copia de seguridad
pl: Zrób kopię rezerwową
pt: Fazer um backup.
ru: Резервная копия

source: Restore from backup
es: Restaurar de la copia
pl: Przywróć z kopii
pt: Restaurar um backup.
ru: Восстановить из копии

source: Install structure
es: Instalar la structura
pl: Zainstaluj strukturę
pt: Instalar a estrutura.
ru: Импортировать структуру

source: Quit Alt-F4
es: Salir Alt-F4
pl: Wyjście Alt-F4
pt: Sair ALT-F4
ru: Выход Alt-F4

source: Quit the application
es: Salir el programa
pl: Wyjście z programu
pt: Sair do programa
ru: Выход из программы

source: &File
es: &Archivo
pl: &Plik
pt: &Ficheiro
ru: &Файл

source: Employees
es: Empleadores
pl: Pracownicy
pt: Colaboradores
ru: Работники

source: Edit list of employees and jobs assigned to them
es: Revisar la lista de los empleadores y los puestos para ellos
pl: Edytuj listę pracowników i stanowisk
pt: Edite a lista de colaboradores e os cargos que a eles estão atribuidos.
ru: Изменить список работников и позиций

source: Edit
es: Revisar
pl: Edytuj
pt: Editar
ru: Изменить

source: General
pl: Ogólne
pt: Geral
ru: Общее

source: Edit database and program settings
es: Revisar la configuración de la base de datos y del programa
pl: Edtuj ustawienia bazy danych i programu
pt: Editar base de dados e configuração do programa.
ru: Изменить настройки базы данных и програмы

source: Settings
es: Configuración
pl: Ustawienia
pt: Configuração
ru: Настройки

source: About F1
es: Sobre el programa F1
pl: O programie F1
pt: Sobre F1
ru: О программе F1

source: Show info about this application
es: Muestra la información sobre el programa
pl: Pokaż inforacje o tym programie
pt: Mostrar informação sobre esta aplicação.
ru: Показать информацию о программе

source: Help
es: Ayuda
pl: Pomóc
pt: Ajuda
ru: Помощь

source: Time In
es: Inicio
pl: Login
pt: Entrada
ru: Вход

source: Time Out
es: Fin
pl: Logout
pt: Saida
ru: Выход

source: Duration
es: Duración
pl: Duracja
pt: Duração
ru: Длительность

source: Wage
es: Sueldo
pl: Opłata
pt: Salário
ru: Оплата

source: To pay
es: Pagar
pl: Zapłata
pt: A pagar
ru: Заплатить

source: Hours
es: Horas
pl: Czas
pt: Horas
ru: Часы

source: Earned
es: Ganado
pl: Zarobione
pt: Ganho
ru: Заработано

source: Regular Time:
es: Tiempo normal:
pl: Zwykły czas:
pt: Horario de trabalho
ru: Обычное время:

source: Overtime:
es: Horas extraordinarias:
pl: Nadgodziny:
pt: Horas extra
ru: Сверхурочные:

source: Total Time:
es: Tiempo Total:
pl: Cały czas:
pt: Total de horas
ru: Всё время:

source: Connected to database '
es: Conectado a la base de datos '
pl: Połączny z bazą danych '
pt: Ligado á base de dados.
ru: Подключены к базе данных '

source: ' on
es: ' en
pl: ' na
pt: ' ligado
ru: ' на

source: Unable no connect to database '
es: Ha sido imposible conectar a la base de datos '
pl: Nie można połączyć się z bazą danych '
pt: Impossivel efectuar ligação á BD
ru: Невозможно подключиться к базе данных '

source: Unable to connect to the database. Reason:
es: Ha sido imposible conectar a la base de datos. Causa:
pl: Nie można połączyć się z bazą danych. Przyczyna:
pt: Impossivel efectuar a ligação á BD. Razão:
ru: Невозможно подключиться к базе данных. Причина:

source: Not connected.
es: No conectado.
pl: Nie połączony.
pt: Não está ligado
ru: Не подключены.

source: no entry
es: no hay entradas
pl: nie ma zapisów
pt: sem entradas
ru: нет записей

source: Select file
es: Seleccione archivo
pl: Wybierz plik
pt: seleccionar ficheiro
ru: Выберите файл

source: There was a problem. Backup is not done.
es: Ha aparecido el problema. Copia de seguridad no ha sido creada.
pl: Powstał problem. Kopia bazy nie została stworzona.
pt: Houve um problema, o backup não foi efectuado.
ru: Возникла проблема. Резервная копия не была создана.

source: You are not connected to the database!
es: No hay conección con la base de datos!
pl: Nie połóczono z bazą danych!
pt: Não está ligado á BD.
ru: Вы не подключены к базе данных!

source: There was a problem. Data is not restored.
es: Ha aparecido el problema. Los datos no han sido reocuperados.
pl: Powstał problem. Dane nie zostały przywrócone.
pt: Houve um problema, a informação não foi restaurada.
ru: Возникла проблема. Данные не были восстановлены.

source: There was a problem. Database structure is not installed
es: Ha aparecido el problema. La estructura no ha sido reocuperada.
pl: Powstał problem. Struktura bazy danych nie została stworzona
pt: Houve um problema, a estrutura da BD não foi instalada.
ru: Возникла проблема. Структура базы данных не была создана.

source: Time settings
es: Configuración del tiempo
pl: Ustawienia czasu
pt: Configuração do relógio.
ru: Настройки времени

source: New payweek starts from:
es: Nueva semana empieza desde:
pl: Nowy tydzeń rozpoczyna się z:
pt: Nova semana começa (dia/semana).
ru: Новая неделя начинается от:

source: Overtime limit week hours:
es: Horas extras semanales empiezan desde:
pl: Tygodniowa liczba czasów dla rozpoczęcia nadgodzin:
pt: Limite horas extras por semana.
ru: Недельный лимит обычного времени:

source: Overtime limit day hours:
es: Horas extras diarias empiezan desde:
pl: Dniowa liczba czasów dla rozpoczęcia nadgodzin:
pt: Limite horas extras por dia.
ru: Дневной лимит обычного времени:

source: Overtime wage multiplier
es: Pago extra multiplicador
pl: Wskaźnik nadgozin
pt: Multiplicador de horas extras.
ru: Умножтель оплаты за сверхурочные

source: Appearance
es: Apariencia
pl: Wygląd
pt: Aparencia
ru: Внешний вид

source: Spanish
es: Español
pl: Hiszpański
pt: Espanhol
ru: Испанский

source: Polish
es: Polaco
pl: Polski
pt: Polaco
ru: Польский

source: Russian
es: Ruso
pl: Rosyjski
pt: Russo
ru: Русский

source: You need to restart program for language settings to take effect!
es: Es necesario reanudar el programa, para que la configuración de las lenguas funccione!
pl: Trzeba zrestartować program, żeby zadziałały ustawienia językowe!
pt: Precisa de reiniciar o programa para que a configuração seja definitiva.
ru: Необходимо перезапустить программу, чтобы настройки языка вошли в силу!

source: Database
es: Base de datos
pl: Baza danych
pt: Base de dados
ru: База данных

source: Program settings
es: Configuración del programa
pl: Ustawienia programu
pt: Configuração do programa
ru: Настройки програмы

source: Employees and jobs editing
es: Revisar los empleadores y los puestos
pl: Edytuj listę pracowników i stanowisk
pt: Editor de colaboradores e cargos.
ru: Редакция списка работников и позиций

source: Only numeric values (4 digits) are alowed
es: Sólo los numéricos (4 cifras) son posibles
pl: Tylko liczby(4 cyfry max) są dozwolone
pt: Só valores numéricos são permitidos (4 dig.)
ru: Допускаются только цифровые значения (макс. 4 цифры).

source: Add new employee to the list
es: Añadir nuevo empledor a la lista
pl: Dodaj nowego pracownika do listy
pt: Adicionar novo colaborador á lista...
ru: Добавить нового работника к списку

source: Change
es: Cambiar
pl: Zmień
pt: Modificar
ru: Изменить

source: Change employee info
es: Cambiar la información
pl: Zmień info prcownika
pt: Modificar informação do colaborador.
ru: Изменить информацию о работнике

source: Delete selected employee from the list
es: Suprimir el empleador seleccionado de la lista
pl: Skasuj wybranego pracownika z listy
pt: Apagar colaborador da lista.
ru: Удалить выбранного работника из списка

source: Employee's list of jobs:
es: Lista de los puestos:
pl: Lista stanowisk pracownika:
pt: Listagem de cargos de colaboradores.
ru: Список позиций работника:

source: Remove
es: Quitar
pl: Skasuj
pt: Remover
ru: Удалить

source: Remove selected job from the list of jobs assigned to an employee
es: Quitar el puesto seleccionado de la lista de los puestos del empleador
pl: Skasuj wybrane staowisko z listy stanowisk wybranego pracownika
pt: Remover cargo seleccionado da lista de cargos atribuidos ao colaborador.
ru: Удалить выбранную позицию из списка позиций для выбранного работника

source: Press this button to assign a job to an employee
es: Pulse, para asignar el puesto al empleador
pl: Wciśnij, żeby dodać stanowisko dla wybranego pracownika
pt: Click no botão para adicionar este cargo ao colaborador.
ru: Нажмите кнопку, чтобы добавить позицию к работнику

source: Jobs
es: Puestos
pl: Stanowiska
pt: Cargos.
ru: Позиции

source: Job title:
es: Título del puesto:
pl: Nazwa stanowiska:
pt: Titulo do cargo.
ru: Название:

source: Wage:
es: Sueldo:
pl: Opłata:
pt: Vencimento
ru: Оплата:

source: Enter job wage here
es: Ponga el sueldo del puesto aquí
pl: Wprować opłatę stanowiska
pt: Introduza o vencimento.
ru: Введите сумму оплаты за час

source: Add new job to the list
es: Aádir nuevo puesto a la lista
pl: Dodaj nowe stanowisko do listy
pt: Adicionar novo cargo á lista.
ru: Добавить новую позицию к списку

source: Change job info
es: Cambiar la inforamción de la puesto
pl: Zmień info stanowiska
pt: Modificar informação do cargo.
ru: Изменить информацию о позиции

source: Delete a job from the list
es: Queitar el puesto de la lista
pl: Skasuj stanowisko z listy
pt: Apagar cargo da lista.
ru: Удалить позицию из списка

source: Close this window
es: Cerrar la ventana
pl: Zamknij to okno
pt: Fechar
ru: Закрыть это окно

source: This worker already exists.
es: Este empleador ya existe.
pl: Ten pracownik już istnieje.
pt: Este colaborador já existe.
ru: Этот работник уже в списке.

source: This job already exists.
es: Este puesto ya existe.
pl: To stanowisko już istnieje.
pt: Este cargo já existe.
ru: Эта позиция уже в списке.

source: Overtime settings
es: Configuración de las horas extraordinarias
pl: Ustawienia nadgodzin
pt: Configuração horas extras
ru: Установки сверхурочных

source: Set and edit overtime limits settings
es: Cambie y revise limites de las horas extraordinarias
pl: Ustaw i zmień ustawienia nadgodzin
pt: Editar limites de horas extras
ru: Установка и редактирование лимитов сверхурочных

source: Default
es: Por omisión
pl: Domyslne
pt: Por defeito
ru: По умолчанию

source: You can't delete default settings! Please set another settings as default before deleting!
es: No se puede borrar la opción por omisión! Hay que establecer otra opción por omisión antes de borrar esta.
pl: Nie można skasować domyślnych ustawień! Proszę najpierw ustawić inne ustawienia jako domyślne przed kasowaniem!
pt: Não pode apagar a configuração por defeito.Por favor estabeleça uma nova configuração, antes de apagar.
ru: Вы не можете удалить установки по умолчанию! Пожалуйста установите другие установки по умолчанию прежде чем удалять эти!

source: Overtime limits:
es: Limites de horas extraordinarias:
pl: Prógi nadgodzin:
pt: Limite de horas extras
ru: Пороги сверхурочных:

source: Week starts from:
es: La semana comienza a partir de:
pl: Tydzień zaczyna się od:
pt: A semana começa a partir de:
ru: Неделя начинается с:

source: Day limit:
es: Límite diario:
pl: Próg dzienny:
pt: Dia limite
ru: Дневной порог:

source: Week limit:
es: Límite semanal:
pl: Próg tygodniowy:
pt: Limite da semana
ru: Недельный порог:

source: Overtime multiplier:
es: Pago extra multiplicador
pl: Mnożnik nadgodzin:
pt: Multiplicador de horas extras
ru: Множитель оплаты за сверхурочные:

source: Overtime limits
es: Limites de horas extraordinarias
pl: Prógi nadgodzin
pt: Limite de horas extras
ru: Пороги сверхурочных

source: Database was updated!
es: Base de datos ha sido actualizada!
pl: Baza danych została zaktualizowana!
pt: A base de dados foi actualizada
ru: База данных обновлена!

source: File pathes:
es: Rutas para archivos:
pl: Ścieżki do plików:
pt: Caminho do fiheiro
ru: Пути файлов:

source: Use own path to Mysql bin directory
es: Usa su propia ruta para la carpeta de MySQL
pl: Uzyj własnej ścieżki do folderu z MySQL
pt: Utilizar caminho próprio para o directorio bin do Mysql
ru: Используется собственный путь для папки bin MySQL

source: MySQL bin directory path:
es: Ruta para la carpeta de MySQL:
pl: Ściażka do folderu bin instalacji MySQL
pt: Caminho do directorio /bin do Mysql
ru: Путь к папке bin MySQL:

source: Select a folder
es: Elige la carpeta
pl: Wybierz folder
pt: Escolha uma directoria
ru: Выберите папку

source: Portuguese
es: Portugués
pl: Portugalski
pt: Português
ru: Португальский

source: Advanced settings
es: Configuración avanzada
pl: Ustawienia zaawansowane
pt: Configuração avançada
ru: Продвинутые установки

source: Main
es: Principal
pl: Główne
ru: Главное

source: Translations
es: Traducciones
pl: Tłumaczenia
ru: Переводы
